// 1. Вывести числа от 1 до 10 в консоль.

for (let i = 0; i <= 10; i++) {
  // console.log(i);
}
// 2. Вывести квадраты чисел от 1 до 10 в консоль.

for (let i = 0; i <= 10; i++) {
  // console.log(i*i);
}

// 3. Посчитать сумму чисел от 1 до 100.
for (let i = 1; i <= 100; i++) {
  console.log(i);
}

// 4. Найти сумму всех четных чисел от 1 до 1000.

// 5. Нарисовать треугольник из символов в консоли.

// 6. Найти факториал числа 10.

// 7. Создать массив с числами от 1 до 100.

// 8. Найти среднее арифметическое чисел от 1 до 100.

// 9. Посчитать сумму всех чисел в массиве.

// 10. Найти минимальное число в массиве.